Repository: ministryofjustice/cla_backend
Catalog: cla_backend/translations/*/LC_MESSAGES/django.po
Languages: cy

source: Family mediation can help people whose relationships have broken down to reach their own agreement about money, property and childcare, without going to court. If the client wants legal advice to support of ongoing or recently completed mediation process this will be in scope. This can include making any agreement reached in mediation legally binding by applying to the court (a consent order). *Please note: Mediation must be ongoing or have concluded. Clients will not qualify for Civil Legal Advice advice where mediation has not yet taken place or they have only attended Mediation Assessment Information Meeting (MIAM).*
cy: Gall cyfryngu teuluol helpu pobl sydd â pherthynas sydd wedi chwalu, i ddod i gytundeb eu hunain ynghylch arian, eiddo a gofal plant heb fynd i'r llys. Os yw'r cleient eisiau cyngor cyfreithiol i gefnogi proses cyfryngu parhaus neu gyfryngu sydd wedi dod i ben yn ddiweddar, yna bydd hyn o fewn y cwmpas. Gall hyn gynnwys gwneud unrhyw gytundeb a ddaethpwyd iddo yn y cyfarfod cyfryngu a'i rwymo mewn cyfraith drwy wneud cais i'r llys (gorchymyn cydsynio). * Sylwch: Rhaid i'r cyfryngu fod yn barhaus neu wedi dod i ben. Ni fydd cleientiaid yn gymwys am gyngor gan Cyngor Cyfreithiol Sifil os na fydd y cyfryngu wedi digwydd eto neu os mai dim ond Cyfarfod Cyfryngu, Gwybodaeth ac Asesu (MIAM) y maent wedi'i fynychu.*

source: Please read out the following to the client: *Based on what you have told me today your problem may be covered by legal aid. But you will still need to show that you qualify financially.* *I’m afraid that Civil Legal Advice does not provide advice about the issue that you are calling about. But our service is not your only option and I will direct you to alternative help.* *I can’t guarantee that these organisations/this organisation will take on your case under legal aid so please check with them to see whether they are able to help you. If you do not qualify for legal aid you may have to pay for their service. So check any costs, their opening hours and whether you can make an appointment. Also check any insurance policies you may have that provide legal cover as any potential costs may be covered by this.*
cy: Darllenwch y canlynol ar lafar i'r cleient: * Ar sail yr hyn yr ydych wedi ei ddweud wrthyf fi heddiw, efallai y byddwch yn gymwys i gael cymorth cyfreithiol am eich problem. Ond bydd rhaid i chi dal ddangos eich bod yn gymwys yn ariannol. * * Mae arna'i ofn nad yw Cyngor Cyfreithiol Sifil yn darparu cyngor ynghylch y mater yr ydych yn ffonio amdano i'w drafod. Ond nid ein gwasanaeth ni yw eich unig opsiwn, a byddaf yn ceisio eich cyfeirio at gymorth gwahanol.* * Ni allaf warantu y bydd y sefydliadau/ sefydliad hwn yn cymryd eich achos dan gymorth cyfriethiol, felly gwiriwch gyda hwy i weld os allant eich helpu. Os nad ydych yn gymwys am gymorth cyfreithiol efallai bydd rhaid i chi dalu am eu gwasanaeth. Felly gwiriwch unrhyw gostau, eu horiau agor ac os gallwch wneud apwyntiad. Hefyd, gwiriwch unrhyw bolisiau yswiriant sydd gennych a allai ddarparu sicrwydd cyfreithiol oherwydd efallai y bydd yn talu am unrhyw gostau posibl.*

source: Domestic abuse (including psychological, physical, financial, sexual or emotional abuse, forced marriage, child abduction, female genital mutilation and harassment). Also includes defence against a non-molestation or occupation order where the client is the alleged abuser.
cy: Cam-drin domestig (gan gynnwys cam-drin seicolegol, corfforol, ariannol, rhywiol neu emosiynol, priodas dan orfod, herwgydio plentyn, anffurfio organau cenhedlu menywod ac aflonyddu). Hefyd yn cynnwys amddiffyn yn erbyn gorchymyn anheddu neu orchymyn rhag molestu os mai'r cleient yw'r camdriniwr honedig.

source: Where a Client wants to seek a court order to protect themselves or a child from abuse via a court order 'an injunction' that tells a person they're not allowed to do a certain act. Some clients who are the alleged abuser do not agree with the injunction against them and wish to get help in defending themselves against it. Guidance contains an article "Domestic violence and abuse - definition" for more information. Search for 'dv' or 'abuse' to find it quickest.
cy: Pan fo cleient eisiau ceisio am orchymyn llys i ddiogelu eu hunain neu blentyn rhag cam-drin drwy orchymyn llys 'gwaharddeb' sy'n dweud wrth unigolyn nad ydynt yn cael cyflawni gweithred benodol. Ni fydd rhai cleientiaid sy'n gamdrinwyr honedig yn cytuno â'r waharddeb yn eu herbyn ac yn dymuno cael cymorth i amddiffyn eu hunain yn ei erbyn. Mae'r Canllaw yn cynnwys erthygl "Trais a Cham-drin Domestig - diffiniad" i gael rhagor o wybodaeth. Chwiliwch am 'dv' neu 'abuse' i ddod o hyd iddi'n gynt.

source: Forced marriage - the client wants advice
cy: Priodas dan orfod - mae'r cleient eisiau cyngor

source: This is where a marriage is about to take place or has taken place without the full and free consent of each party. This may be due to actual or threats of physical force or violence, emotional pressure or psychological abuse. Civil Legal Advice Specialists can offer advice on seeking an order to protect the client from such a marriage occuring or how to end such a marriage.
cy: Dyma lle mae priodas ar fin cael ei chynnal neu wedi'i chynnal heb ganiatâd llawn a rhydd gan bob parti. Gall hyn fod oherwydd bygythiadau gwirioneddol neu fygythiadau i drais neu rym corfforol, pwysau emosiynol neu gam-drin seicolegol. Gall Arbenigwyr Cyngor Cyfreithiol Sifil gynnig cyngor ar geisio am orchymyn i ddiogelu'r cleient rhag i briodas o'r fath ddigwydd neu sut i ddod â phriodas o'r fath i ben.

source: Is there a dispute for which family mediation is relevant? If so, please check if client has heard of/and considered Family Mediation. *On the following screen please select if they want to find a local mediator, or that mediation isn't relevant to the problem. Click next to continue.*
cy: A oes anghydfod lle mae cyfryngu teuluol yn berthnasol? Os oes, gwiriwch os yw'r cleient wedi clywed am/ac wedi ystyried Cyfryngu Teuluol. * Ar y sgrîn ganlynol, bydd angen dewis os ydynt angen cyfryngwr lleol, neu os nad yw cyfryngu yn berthnasol i'r broblem. Cliciwch nesaf i barhau.*

source: Family mediators are trained to work with people whose relationships have broken down. They will listen to both sides of the argument and help you to reach your own agreement about money, property and childcare, without going to court. It is not just separating couples that can use mediation. It may also help grandparents or step-families resolve their issues. Mediation provides a safe and neutral setting for you to talk and explore your concerns and needs to each other. Search for 'Family Mediation' in the guidance search box for more help. If you are qualify you can get legal aid for family mediation as well as legal advice to support the mediation process. This can include the cost of making any agreement that you reach in mediation legally binding by applying to the court - this is called applying for a consent order.
cy: Mae cyfryngwyr teuluol wedi cael eu hyfforddi i weithio gyda phobl sydd â pherthynas wedi chwalu. Byddant yn gwrando ar ddwy ochr o'r ddadl ac yn eich helpu i ddod i gytundeb eich hunain ynghylch arian, eiddo a gofal plant, heb fynd i'r llys. Nid cyplau sy'n gwahanu yn unig y gall ddefnyddio gwasanaeth cyfryngu. Gall helpu teidiau a neiniau neu lys deuluoedd i ddatrys eu problemau. Mae cyfryngu yn darparu sefyllfa ddiogel a diduedd i chi siarad ac edrych ar eich pryderon ac anghenion eich gilydd. Chwiliwch am 'Cyfryngu Teuluol' yn y blwch chwilio yn y canllaw i gael rhagor o gymorth. Os ydych yn gymwys cewch gymorth cyfreithiol i gael cyfryngu teuluol yn ogystal â chyngor cyfreithiol i'ch cefnogi yn y broses cyfryngu. Gall hyn gynnwys cost o wneud unrhyw gytundeb yr ydych yn dod iddo yn y cyfryngu yn rhwymo mewn cyfraith drwy ei gyflwyno i'r llys - gelwir hyn yn gwneud cais am orchymyn cydsynio.

source: Client wishes to find mediator.
cy: Cleient yn dymuno dod o hyd i gyfryngwr

source: Client does not wish to find a mediator.
cy: Nid yw'r cleient yn dymuno dod o hyd i gyfryngwr

source: Please read the following to the client: *If you have Internet access I can tell you where to find more information about Family Mediation and how to search for a family mediator.* *Or I can find a family mediation service for you now.* *If you qualify you may be able to get legal aid to cover the costs of Family Mediation as well as legal advice to support the mediation process. Or you may need to pay for the service. Please speak to the mediation service to find out more.* You should now direct the client to their nearest contracted quality assured family mediation service using the directory (Find An Adviser tool)
cy: Darllenwch y canlynol i'r cleient: * Os oes gennych fynediad i'r rhyngrwyd, gallaf ddweud wrthych ble i gael rhagor o wybodaeth am Gyfryngu Teuluol a sut i chwilio am gyfryngwr teuluol.* * Neu gallaf ddod o hyd i wasanaeth cyfryngu teuluol i chi yn awr.* * Os ydych yn gymwys efallai y cewch gymorth cyfreithiol i dalu costau Cyfryngu Teuluol yn ogystal â chyngor cyfreithiol i gefnogi'r broses gyfryngu. Neu efallai bydd angen i chi dalu am y gwasanaeth hwn. Siaradwch â'r gwasanaeth cyfryngu i gael rhagor o wybodaeth.* Dylech gyfeirio'r cleient i'r gwasanaeth cyfryngu teuluol agosaf sydd â sicrhad ansawdd gan ddefnyddio'r cyfeiriadur (arf Dod o hyd i Gynghorwr)

source: The client has already taken action to stop domestic abuse (e.g. via an injunction) but needs to take further action as the order is not being complied with
cy: Mae'r cleient eisoes wedi cymryd camau i atal cam-drin domestig (e.e. drwy waharddeb) ond mae angen cymryd camau pellach gan na chydymffurfir â'r gorchymyn

source: Between two or more individuals.
cy: Rhwng dau neu fwy o unigolion.

source: Divorce/Nullity/Dissolution
cy: Ysgariad/ Dirymiad/ Diddymiad

source: * Divorce - ending a marriage * Nullity - declaring a marriage null and void so it is regarded not to have taken place * Dissolution - ending a same sex Civil Partnership
cy: * Ysgariad - dod â phriodas i ben * Dirymiad - datgan priodas yn ddi-rym felly ni ystyrir ei bod wedi digwydd * Diddymiad - dod â Phartneriaeth Sifil o'r un rhyw i ben

source: Children disputes (eg contact with children)
cy: Anghydfod ynglŷn â phlant (e.e. cyswllt gyda phlant)

source: Includes advice on the following areas * Parental Responsibility * Contact * Residence * Transferring status of Parentage
cy: Cynnwys cyngor ar y meysydd canlynol * Cyfrifoldeb Rhiant * Cyswllt * Preswylio * Trosglwyddo statws teulu

source: Financial matters
cy: Materion ariannol

source: Includes advice on financial disputes arising out of: * Divorce/separation (including civil partnerships) including Inheritance and trusts of land * Transfer of tenancies on divorce/separation * Maintenance
cy: Yn cynnwys cyngor am anghydfod ariannol sy'n codi drwy: * Ysgariad/ymwahaniad (gan gynnwys partneriaeth sifil) gan gynnwys Etifeddiaeth ac ymddiriedolaeth tir * Trosglwyddo tenantiaeth ar ôl ysgariad/ ymwahaniad * Cynhaliaeth

source: Not a dispute for which mediation is relevant.
cy: Nid yw cyfryngu yn berthnasol i'r anghydfod hwn.

source: The client is under 18
cy: Mae'r cleient o dan 18 oed

source: No abuse.
cy: Dim cam-drin.

source: The matter relates to a child in care, a care leaver, or the call is made by a foster carer.
cy: Mae'r mater yn ymwneud â phlentyn sydd mewn gofal, plentyn yn gadael gofal, neu mae'r alwad yn cael ei gwneud gan ofalwr maeth.

source: The client may have been discriminated against (select this button to proceed to the discrimination category)
cy: Efallai bod y cleient wedi profi gwahaniaethu (dewiswch y botwm hwn i barhau i'r categori gwahaniaethu)

source: Female genital mutilation - the client is worried they may become a victim
cy: Anffurfio organau cenhedlu benywod - mae'r cleient yn poeni y gallant ddod yn ddioddefwr

source: International child abduction – The client lives abroad but their child has been taken to the UK
cy: Herwgydio plentyn yn rhyngwladol - Mae'r cleient yn byw dramor ond aethpwyd â'u plentyn i'r DU

source: Any other child abduction problem
cy: Unrhyw broblem arall yn ymwneud â herwgydio plentyn

source: Seeking protection from the unlawful removal of a child from the UK or the return of a child who has been unlawfully removed from the UK or unlawfully removed within the UK. A child is someone under 18 and the client must be the parent or someone with parental responsibility for that child.
cy: Ceisio am ddiogelwch rhag symud plentyn o'r DU yn anghyfreithlon, neu ddychwelyd plentyn sydd wedi cael ei symud yn anghyfreithlon o'r DU, neu wedi ei symud yn anghyfreithlon o fewn y DU. Plentyn yw rhywun sydd o dan 18 oed a rhaid i'r cleient fod yn rhiant neu rywun sydd â chyfrifoldeb rhiant am y plentyn hwnnw.

source: No financial assessment is needed for this problem.
cy: Nid oes angen asesiad ariannol ar gyfer y broblem hon.

source: The client’s social landlord intends to get (or has got) an Antisocial Behaviour Order or Antisocial Behaviour Injunction against the client or someone living with them.
cy: Mae landlord cymdeithasol y cleient yn bwriadu cael (neu wedi cael) Gorchymyn Ymddygiad Gwrthgymdeithasol neu Waharddeb Ymddygiad Gwrthgymdeithasol yn erbyn y cleient neu yn erbyn rhywun sy'n byw gyda nhw.

source: Client has private landlord
cy: Mae gan y cleient landlord preifat

source: Client has received an ASBO/ASBI and wishes to challenge
cy: Cleient wedi cael ASBO/ASBI ac yn dymuno ei herio

source: Court has issued notice of ASBO/ASBI proceedings
cy: Llys wedi cyflwyno rhybudd o achos ASBO/ASBI

source: Client has received a letter from their social landlord (including local authorities) confirming an intention to apply for an ASBO or ASBI
cy: Mae'r cleient wedi cael llythyr gan eu landlord cymdeithasol (gan gynnwys awdurdodau lleol) yn cadarnhau bwriad i wneud cais am ASBO neu ASBI

source: Django site admin
cy: Adran weinyddol safle Django

source: Civil Legal Advice
cy: Cyngor Cyfreithiol Sifil

source: Reset lockout
cy: Ailosod y clo

source: Models in the %(name)s application
cy: Modelau yn y rhaglen %(name)s

source: Add
cy: Ychwanegu

source: Change
cy: Newid

source: You don't have permission to edit anything.
cy: Nid oes gennych hawl i olygu dim byd.

source: Recent Actions
cy: Gweithredoedd Diweddar

source: My Actions
cy: Fy Ngweithredoedd

source: None available
cy: Dim ar gael

source: Unknown content
cy: Cynnwys dieithr

source: Home
cy: Hafan

source: Reports
cy: Adroddiadau
