Repository: ministryofjustice/cla_backend
Catalog: cla_backend/translations/*/LC_MESSAGES/django.po
Languages: cy

source: Check the mortgage possession timeline in guidance - search for 'timeline'. Record here how you have identified that the mortgage lender is seeking/has sought a court order enabling them to recover possession of the client's property. Record in Operator Notes what documents client has received. These may include a Default Notice or Possession Warrant.
cy: Gwiriwch y linell amser meddiannu morgais yn y canllaw - chwiliwch am 'llinell amser'. Cofnodwch yma sut ydych chi wedi adnabod bod y benthyciwr morgais yn ceisio/ wedi ceisio am orchymyn llys i'w galluogi i adfer meddiant o eiddo'r cleient. Cofnodwch yn Nodiadau Gweithredwr pa ddogfennau y mae'r cleient wedi'u cael. Gall y rhain gynnwys Rhybudd Diffygdalu neu Warant i Feddiannu.

source: Select the type of documentation the client has received:
cy: Dewiswch y math o ddogfennau mae'r cleient wedi'u derbyn

source: A warrant of possession has been received by client
cy: Mae'r cleient wedi derbyn gwarant i feddiannu

source: HEADING ON WARRANT
cy: PENNAWD AR Y WARANT

source: A claim form has been received by client
cy: Mae'r cleient wedi derbyn ffurflen hawlio

source: HEADING ON CLAIM FORM
cy: PENNAWD AR Y FFURFLEN HAWLIO

source: The client has other documentation that places their home at immediate (date-based) risk
cy: Mae gan y cleient ddogfennaeth arall sy'n rhoi eu cartref mewn perygl di-oed (yn seiliedig ar ddyddiad)

source: HEADING ON OTHER
cy: PENNAWD AR ARALL

source: A creditor is seeking a court order forcing the sale of the client’s property to recoup the debt they are owed
cy: Mae credydwr yn ceisio am orchymyn llys i orfodi gwerthu eiddo'r cleient i adennill y ddyled sy'n ddyledus iddynt

source: Sale of client's home is being forced in order to recoup a charging order on their property.
cy: Mae gwerthiant cartref y cleient yn cael ei orfodi er mwyn adennill gorchymyn arwystlo ar eu heiddo.

source: A Charging Order is placed on a property by the court securing an outstanding debt against the home or other property. This alone will not constitute a serious risk to the client's home, but if there is a court order forcing the sale of the home in order to recoup the debt then this will be in scope. If a client disagrees with a charging order that is in place, and wants to know how to set it aside, or requires general advice regarding the order, then this will be out of scope unless a court is forcing them to sell their home to recoup the debt. If client has received a charging order please record this in Operator Notes.
cy: Mae'r llys wedi rhoi Gorchymyn Arwystlo ar yr eiddo i ddiogelu dyled sy'n ddyledus yn erbyn y cartref neu eiddo arall. Ni fydd hyn ar ben ei hun yn creu risg difrifol i gartref y cleient, ond os oes gorchymyn llys yn gorfodi gwerthiant o'r cartref er mwyn adennill y ddyled, yna bydd hyn o fewn y cwmpas. Os yw cleient yn anghytuno â gorchymyn arwystlo sydd mewn lle, ac eisiau gwybod sut i'w roi o'r neilltu, neu angen cyngor cyffredinol mewn perthynas â'r gorchymyn, yna bydd hyn allan o'r cwmpas oni bai bod llys yn eu gorfodi i werthu eu cartref i adennill y ddyled. Os yw cleient wedi cael gorchymyn arwystlo, cofnodwch hyn yn Nodiadau'r Gweithredwr.

source: Letter Before Action received by client
cy: Cleient wedi derbyn Llythyr Cyn Gweithredu

source: client is being taken to court on a given date due to debt
cy: mae'r cleient yn mynd i'r llys ar ddyddiad penodol oherwydd dyled

source: Other documentation that places client’s own home at immediate (date based) risk.
cy: Dogfennaeth arall sy'n rhoi cartref y cleient ei hun mewn perygl di-oed (seiliedig ar ddyddiad).

source: A creditor is seeking to make the client bankrupt in order to recoup the debt they are owed and the client’s estate includes their own home
cy: Mae credydwr yn ceisio i wneud y cleient yn fethdalwr er mwyn adennill y ddyled sy'n ddyledus iddynt ac mae ystad y cleient yn cynnwys ei gartref ei hun

source: Statutory Demand
cy: Hawliad Statudol

source: court has ordered the client sell their house
cy: mae'r llys wedi gorchymyn i'r cleient i werthu eu tŷ

source: Bankruptcy Petition
cy: Deiseb Methdalu

source: formal notification that third party wants to make client bankrupt through the courts
cy: hysbysiad ffurfiol bod trydydd parti eisiau gwneud y cleient yn fethdalwr drwy'r llysoedd

source: In rented accommodation
cy: Mewn llety rhent

source: The landlord is seeking to recover possession of the property
cy: Mae'r landlord yn ceisio adfer meddiant o'r eiddo

source: Letter from the landlord confirming that informal arrangements can no longer continue
cy: Llythyr gan y landlord yn cadarnhau na ellir parhau â threfniadau anffurfiol

source: Notice to Quit (a letter from the landlord giving the tenant notice to leave the property - for cases where the renting arrangement does not have a secure tenure)
cy: Rhybudd i Adael (llythyr gan y landlord yn rhoi rhybudd i'r tenant i adael yr eiddo - ar gyfer achosion lle nad oes daliadaeth sicredig yn y trefniadau rhentu)

source: Letter Before Action (a letter the landlord sends before starting proceedings to recover possession of the property)
cy: Llythyr Cyn Gweithredu (llythyr y mae'r landlord yn ei anfon cyn dechrau achos i adfer meddiant o'r eiddo)

source: Notices from the landlord under section 83 of the Housing Act 1985 and sections 8 and 21 of the Housing Act 1988 (these give the client notice before the landlord starts formal possession proceedings for the property)
cy: Rhybuddion gan y landlord dan adran 83 o Ddeddf Tai 1985 ac adrannau 8 a 21 o Ddeddf Tai 1988 (mae'r rhain yn rhoi rhybudd i'r cleient cyn i'r landlord ddechrau achos meddiannu ffurfiol mewn perthynas â'r eiddo)

source: Possession proceedings - issued by the court and giving the client notice of a hearing date for possession proceedings
cy: Achosion Meddiannu - wedi'i cychwyn gan y llys ac yn rhoi rhybudd i'r cleient o ddyddiad gwrandawiad ar gyfer achosion meddiannu.

source: Possession Order from the court (this gives the client notice of possession - at the end of the specified period the creditor may apply to bailiffs to execute a warrant for possession)
cy: Gorchymyn Meddiannu gan y llys (mae hyn yn rhoi rhybudd i'r cleient o'r meddiannu - ar ddiwedd cyfnod penodol gall y credydwr wneud cais i'r beili weithredu gwarant meddiannu)

source: Warrant for eviction from the court bailiffs (this gives county court bailiffs the power to evict occupiers and change the locks)
cy: Gwarant troi allan gan feili'r llys (mae hwn yn rhoi pŵer i feili'r llys sirol droi deiliaid allan a newid y cloeon)

source: There is other evidence that landlord is seeking to recover possession and placing the home at immediate risk
cy: Mae tystiolaeth arall bod y landlord yn ceisio adfer meddiant ac yn rhoi'r cartref mewn risg uniongyrchol

source: None of the above - consider whether discrimination might apply
cy: Dim un o'r uchod - ystyried a fyddai gwahaniaethu yn berthnasol

source: The landlord is unlawfully evicting the client without due process (eg will be changing the locks)
cy: Mae'r landlord yn troi'r cleient allan yn anghyfreithlon heb ddilyn y broses gywir (h.y. yn newid y cloeon)

source: Describe scenario carefully in notes - client's circumstances and why they believe they are facing eviction or have been evicted. *Then click 'next' to continue*
cy: Disgrifiwch y senario yn ofalus mewn nodiadau - amgylchiadau'r cleient a pham eu bod yn credu eu bod yn wynebu cael eu troi allan neu wedi cael eu troi allan. * Cliciwch 'nesaf' i barhau*

source: Homeless or at risk of becoming homeless within 56 days
cy: Yn ddigartref neu mewn perygl o ddod yn ddigartref o fewn 56 diwrnod

source: Select the option that best describes the client’s situation.
cy: Dewiswch opsiwn sy'n disgrifio sefyllfa'r cleient orau.

source: The landlord has unlawfully evicted the client without due process
cy: Mae'r landlord wedi troi'r cleient allan yn anghyfreithlon heb ddefnyddio'r broses gywir

source: (eg changed the locks)
cy: (e.e. wedi newid y cloeon)

source: Describe scenario carefully in notes - including the client's circumstances and why they believe they are facing eviction or have been evicted
cy: Disgrifiwch y senario yn ofalus mewn nodiadau - gan gynnwys amgylchiadau'r cleient a pham maent yn credu eu bod yn wynebu cael eu troi allan neu wedi cael eu troi allan

source: An informal licensing or renting arrangement is ending
cy: Mae trefniant rhentu neu drwyddedu anffurfiol yn dod i ben

source: The client has received a Notice to Quit from the landlord
cy: Mae'r cleient wedi derbyn Rhybudd i Adael gan y landlord

source: The client can't access their home (eg due to letter from partner, closure order for property)
cy: Ni all y cleient gael mynediad i'w gartref (e.e. oherwydd llythyr gan bartner, gorchymyn cau i'r eiddo)

source: A court has issued possession proceedings
cy: Llys wedi cychwyn achos meddiannu

source: The client has received a possession order from the court (outlining the decision of the court)
cy: Mae'r cleient wedi derbyn gorchymyn meddiannu gan y llys (yn amlinellu penderfyniad y llys)

source: The client has received a warrant for eviction from the court bailliffs
cy: Mae'r cleient wedi derbyn gwarant troi allan gan feili'r llys

source: The client has received a letter from the local authority saying that they do not qualify for accommodation or assistance and they want to challenge this decision
cy: Mae'r cleient wedi cael llythyr gan yr awdurdod lleol yn dweud nad yw'n gymwys am lety neu gymorth, ac maent eisiau herio'r penderfyniad hwn

source: The client believes it is not reasonable to continue to occupy the property (eg a recently disabled person can't easily access the property, the client can't afford to live in the property, there is a threat of violence towards the client or their family)
cy: Mae'r cleient yn credu nad yw'n rhesymol iddo barhau i feddiannu'r eiddo (e.e. ni all unigolyn sydd newydd ddod yn anabl gael mynediad hawdd i'r eiddo, ni all y cleient fforddio byw yn yr eiddo, mae bygythiad o drais tuag at y cleient neu i'w deulu)

source: The client is being refused accommodation or has had it terminated by the UK Border Force
cy: Gwrthodir llety i'r cleient neu mae Llu Ffiniau'r DU wedi terfynu'r llety

source: Other (please give details in notes)
cy: Arall (rhowch fanylion ar ffurf nodiadau)

source: Owes other money (check that the consequences of this don’t place the client in another category of debt)
cy: Arian arall sy'n ddyledus (gwirio nad yw effaith hyn yn rhoi'r cleient mewn categori arall o ddyled)

source: None of the above - consider whether discrimination might apply and click on 'Help' for examples
cy: Dim un o'r uchod - ystyried a allai gwahaniaethu fod yn berthnasol a chlicio 'Help' i gael enghreifftiau

source: Examples of discrimination in the debt and housing category might include: * the client has been treated differently by their landlord compared to other tenants of the same landlord * the landlord has refused to make reasonable adjustments to the property to accommodate a client's disability * an estate agent is only offering a minority group properties that are considered hard to let
cy: Gall enghreifftiau o wahaniaethu yn y categori dyled a thai gynnwys: * cleient wedi cael ei drin yn wahanol gan ei landlord o'i gymharu â thenantiaid eraill sydd gyda'r un landlord * landlord wedi gwrthod gwneud newidiadau rhesymol i'r eiddo i gymhwyso anabledd y cleient. * gwerthwr tai ond yn cynnig eiddo sy'n anodd i'w osod i grwpiau lleiafrifol

source: Other housing matters
cy: Materion eraill yn ymwneud â thai

source: This category covers the legal area of Housing outside home loss. It covers advice on * threatened loss of home or harassment from landlords * disrepair / poor housing conditions - only where rented accomodation. * ASBO/ASBI For loss of home please click 'back' and select the first category.
cy: Mae'r categori hwn yn ymdrin â maes cyfreithiol Tai sydd y tu allan i golli cartref. Mae'n ymdrin â chyngor am * fygythiad o golli cartref neu aflonyddwch gan landlordiaid * diffyg atgyweirio/ cyflwr gwael y cartref - dim ond llety rhent. * ASBO/ASBI Cliciwch 'yn ôl' ar gyfer colli cartref a dewiswch y categori cyntaf.

source: Housing disrepair (necessary repairs have not been carried out) - for people in **rented** accomodation only
cy: Diffyg atgyweirio tai (nid yw'r gwaith atgyweirio angenrheidiol wedi cael ei gyflawni) - i bobl mewn llety **rhent** yn unig

source: Client has photos of disrepair AND the disrepair puts them or their family at serious risk of harm or injury (this includes an injury or illness that has already happened)
cy: Mae gan y cleient ffotograffau o'r diffyg atgyweirio AC mae'r diffyg atgyweirio yn rhoi eu teulu mewn perygl difrifol o niwed neu anaf (mae hyn yn cynnwys anaf neu salwch sydd wedi digwydd yn barod)

source: Client has report by an expert (e.g. a surveyor) on the disrepair AND the disrepair puts them or their family at serious risk of harm, injury or illness
cy: Mae gan y cleient adroddiad gan arbenigwr (e.e. syrfëwr) ar y diffyg atgyweirio AC mae'r diffyg atgyweirio yn eu rhoi nhw neu eu teulu mewn risg difrifol o niwed, anaf neu salwch

source: ASBO/ASBI (Antisocial Behaviour Order/Antisocial Behaviour Injunction)
cy: ASBO/ASBI (Gorchymyn Ymddygiad Gwrthgymdeithasol/ Gwaharddeb Ymddygiad Gwrthgymdeithasol)

source: Harassment (being threatened or disturbed in your home, on more than one occasion)
cy: Aflonyddwch (cael eich bygwth neu eich cynhyrfu yn eich cartref, ar fwy nag un achlysur)

source: Client is being harassed by a landlord and needs injunction or restraining order
cy: Mae landlord yn aflonyddu ar y cleient ac mae angen gwaharddeb neu orchymyn atal

source: Client is being harassed by a neighbour and needs injunction or restraining order
cy: Mae cymydog yn aflonyddu ar y cleient ac mae angen gwaharddeb neu orchymyn atal

source: Other out of scope, rediagnose
cy: Arall y tu allan i'r cwmpas, ail-wneud diagnosis

source: The family category of law includes advice on: * difficulty in getting contact with children or being denied contact * trying to get custody and parental rights * Social Services involvement with a child * protection from domestic abuse (including psychological, physical, financial, sexual or emotional abuse) * rights and entitlements in divorce or separation * appointing a guardian and the rights of a guardian * trying to adopt a child who's in care * enforcing previous court orders * child abduction
cy: Mae'r categori teulu o'r gyfraith yn cynnwys cyngor ar: * problemau wrth gael cyswllt gyda phlant neu'r cyswllt yn cael ei wrthod * ceisio cael gwarchodaeth a hawliau rhiant * Gwasanaethau Cymdeithasol yn ymwneud â phlentyn * diogelu rhag camdriniaeth ddomestig (gan gynnwys camdriniaeth seicolegol, corfforol, ariannol, rhywiol neu emosiynol) * hawliau mewn ysgariad neu ymwahaniad * penodi gwarcheidwad a hawliau gwarcheidwad * ceisio mabwysiadu plentyn sydd mewn gofal * gorfodi gorchmynion llys blaenorol * herwgydio plentyn

source: Domestic abuse (including child abuse) - the client wants to protect themselves or their children
cy: Cam-drin domestig (gan gynnwys cam-drin plant) - mae'r cleient eisiau diogelu ei hun neu ei blant

source: DV/CA - Where a Client wants to seek a court order to protect themselves or a child from abuse via a court order (an injunction) that tells a person they're not allowed to do a certain act. There are two main forms of injunction A non-molestation order - aimed at preventing a client's partner or ex-partner from using or threatening violence against them or their child, or intimidating, harassing or pestering them. An occupation order can restrict who can live in the family home, and even restrict the abuser from entering the surrounding area. They can also be used where clients do not feel safe continuing to live with their partner, or if they have already left home because of abuse, but want to return and exclude the abuser.
cy: DV/CA - Pan fo Cleient eisiau ceisio am orchymyn llys i ddiogelu eu hunain neu blentyn rhag cam-drin drwy orchymyn llys (sef gwaharddeb) sy'n dweud wrth unigolyn nad oes ganddynt hawl i wneud gweithred benodol. Mae dau brif fath o waharddeb: * Gorchymyn rhag molestu - wedi ei fwriadu i atal partner neu gyn-bartner y cleient rhag defnyddio neu fygwth defnyddio trais yn eu herbyn neu eu plentyn, neu eu bygwth, aflonyddu neu eu poeni. * Gall gorchymyn anheddu gyfyngu ar bwy all fyw yng nghartref y teulu, a hefyd gall atal y camdriniwr rhag dod i'r ardal gyfagos. Gellir ei ddefnyddio pan nad yw'r cleientiaid yn teimlo'n ddiogel i barhau i fyw gyda'u partner, neu eu bod wedi gadael y cartref oherwydd trais yn barod, ond eisiau dychwelyd a chau'r camdriniwr allan.

source: Child abduction - the client wants advice
cy: Herwgydio plentyn - mae'r cleient eisiau cyngor

source: Typically the local council is involved due to child protection concerns.
cy: Yn gyffredinol, mae'r cyngor lleol yn ymwneud â'r achos oherwydd pryderon mewn perthynas ag amddiffyn plant.

source: None of the above (including guardianship, wills and probate, power of attorney, finding a family mediator)
cy: Dim un o'r uchod (gan gynnwys gwarcheidiaeth, ewyllysiau a phrofiant, atwrneiaeth, dod o hyd i gyfryngwr teuluol)

source: The discrimination category covers advice on cases that contravene the Equalities Act 2010. It is against the law to discriminate against anyone because of: * age * gender reassignment * being married or in a civil partnership * being pregnant or having recently given birth * disability * race including colour, nationality, ethnic or national origin * religion, belief or lack of religion or belief * sex * sexual orientation These are called 'protected characteristics'. To find out more, search the guidance for 'protected characteristics'. The client's problem could start in another category (eg housing) but the client will believe that thay have been discriminated against, harassed or victimised.
cy: Mae'r categori gwahaniaethu yn ymdrin â chyngor am achosion sy'n mynd yn groes i Ddeddf Cydraddoldeb 2010. Mae yn erbyn y gyfraith i wahaniaethu yn erbyn rhywun oherwydd: * oed * ailbennu rhywedd * bod yn briod neu mewn partneriaeth sifil * bod yn feichiog neu wedi rhoi genedigaeth yn ddiweddar * hil gan gynnwys lliw, cenedligrwydd, tarddiad ethnig neu wlad * crefydd, cred neu ddiffyg cred neu grefydd * rhyw * cyfeiriadedd rhywiol Gelwir y rhain yn 'nodweddion gwarchodedig'. I gael rhagor o wybodaeth, chwiliwch y canllaw am 'nodweddion gwarchodedig'. Gall problem y cleient ddechrau mewn categori arall (e.e. tai) ond bydd y cleient yn credu ei fod wedi profi gwahaniaethu, aflonyddwch neu erledigaeth.

source: The client has been discriminated against, or they've been treated badly because they complained about discrimination or supported someone else’s discrimination claim It is against the law to discriminate against anyone because of: * age * gender reassignment * being married or in a civil partnership * being pregnant or having recently given birth * disability * race including colour, nationality, ethnic or national origin * religion, belief or lack of religion or belief * sex * sexual orientation
cy: Mae'r cleient wedi cael ei wahaniaethu, neu wedi cael eu trin yn wael oherwydd eu bod wedi cwyno am wahaniaethu neu wedi cefnogi honiad rhywun arall o wahaniaethu Mae hi'n erbyn y gyfraith i wahaniaethu rhywun oherwydd: * oed * ailbennu rhywedd * bod yn briod neu mewn partneriaeth sifil * bod yn feichiog neu wedi rhoi genedigaeth yn ddiweddar * anabledd * hil gan gynnwys lliw, cenedligrwydd, tarddiad ethnig neu wlad * crefydd, cred neu ddiffyg cred neu grefydd * rhyw * cyfeiriadedd rhywiol

source: Select the type of discrimination that applies
cy: Dewiswch y math o wahaniaethu sy'n berthnasol

source: Direct discrimination
cy: Gwahaniaethu uniongyrchol

source: Direct discrimination means being treated less favourably than someone else in similar circumstances due to a protected characteristic (eg the client thinks that they've been singled out for worse treatment or disadvantaged in some way compared to someone else). This includes situations where clients are linked to a person with a protected characteristic and suffer less favourable treatment as a result.
cy: Gwahaniaethu uniongyrchol yw cael eich trin yn llai ffafriol na rhywun arall sydd mewn amgylchiadau tebyg oherwydd nodweddion gwarchodedig (e.e. mae'r cleient yn credu eu bod wedi cael eu dethol i'w trin yn waeth neu dan anfantais o'i gymharu â rhywun arall). Mae hyn yn cynnwys sefyllfaoedd lle mae cleientiaid yn gysylltiedig ag unigolyn sydd â nodweddion gwarchodedig ac yn cael eu trin yn llai ffafriol o ganlyniad i hyn.

source: On what basis has the client been discriminated against? Give details in the operator notes, especially if more than one option applies.
cy: Ar ba sail y mae'r cleient wedi profi gwahaniaethu? Rhowch fanylion yn nodiadau'r gweithredwr, yn arbennig os oes mwy nag un opsiwn yn berthnasol.

source: Disability is defined as a physical or mental impairment, which has a substantial and long term adverse effect on a person's ability to carry out normal day-to-day activities. People with cancer or who are HIV+ are classed as having a disability. The disability does not have to have a name or a diagnosis to meet this definition.
cy: Diffinnir anabledd fel nam corfforol neu feddyliol, sydd ag effaith sylweddol a thymor hir ar allu unigolyn i gyflawni gweithgareddau arferol o ddydd i ddydd. Mae pobl sydd â chancr neu sy'n HIV+ yn cael eu hystyried fel bod ganddynt anabledd. Nid oes rhaid i'r anabledd gael enw neu ddiagnosis i fodloni'r diffiniad hwn.

source: Work
cy: Gwaith

source: Provision of a service (eg a meal in a restaurant, access to a shopping mall)
cy: Darparu gwasanaeth (h.y pryd o fwyd mewn bwyty, mynediad i ganolfan siopa)

source: Exercise of a public function (eg a police officer carrying out a search as part of a criminal investigation)
cy: Cyflawni gweithred gyhoeddus (e.e. heddwas yn cyflawni chwiliad fel rhan o ymchwiliad troseddol)

source: Association or private club (eg a golf club, a private members' club)
cy: Cymdeithas neu glwb preifat (e.e. clwb golff, clwb preifat i aelodau)

source: At home (in rental accommodation)
cy: Gartref (mewn llety rhent)

source: Education (schools)
cy: Addysg (ysgolion)

source: Education (higher education or general qualification bodies)
cy: Addysg (addysg uwch neu gyrff cymwysterau cyffredinol)

source: Age (the client is under 18)
cy: Oed (mae'r cleient dan 18 oed)

source: This refers to discrimination against people of a: * particular age (eg 17-year-olds), or * range of ages (eg 10 to 15-year-olds)
cy: Mae hyn yn cyfeirio at wahaniaethu yn erbyn pobl o: * oedran penodol (h.y. unigolion 17 oed), neu * amrediad o oedran (h.y. unigolion 10 - 15 oed)

source: Education (higher education/general qualification bodies)
cy: Addysg (cyrff cymwysterau cyffredinol/addysg uwch)

source: Age (the client is 18 or over)
cy: Oed (mae'r cleient yn 18 oed neu'n hŷn)

source: This refers to discrimination against people of a: * particular age (eg 19-year-olds), or * range of ages (eg 60 to 80-year-olds)
cy: Mae hyn yn cyfeirio at wahaniaethu yn erbyn pobl: * o oedran penodol (e.e. pobl 19 oed), neu * ystod oedran (e.e. pobl 60 i 80 oed)

source: Exercise of a public function (eg a police officer carrying out a search)
cy: Cyflawni gweithred gyhoeddus (e.e. heddwas yn cyflawni chwiliad)

source: Being married or in a civil partnership
cy: Bod yn briod neu mewn partneriaeth sifil
