Repository: ministryofjustice/cla_backend
Catalog: cla_backend/translations/*/LC_MESSAGES/django.po
Languages: cy

source: This refers to people who are married or in a civil partnership, including same sex couples.
cy: Mae hyn yn cyfeirio at bobl sydd wedi priodi neu mewn partneriaeth sifil, gan gynnwys cyplau o'r un rhyw.

source: Indirect discrimination
cy: Gwahaniaethu anuniongyrchol

source: The client thinks that new ways of doing things have put them at a disadvantage compared to someone else because of a protected characteristic (eg an employer states that employees cannot have dreadlocks or a pub refuses access to people with hats. This puts employees or patrons of a certain religion at a disadvantage when compared to others.)
cy: Mae'r cleient yn credu bod y ffyrdd newydd o wneud pethau wedi ei roi dan anfantais o'i gymharu â rhywun arall oherwydd nodweddion gwarchodedig (e.e. cyflogwr yn nodi na all gweithwyr gael gwallt rhaffog neu dafarn yn gwrthod mynediad i bobl sydd yn gwisgo hetiau. Mae hyn yn rhoi gweithwyr neu noddwyr crefyddau penodedig dan anfantais o'i gymharu ag eraill.)

source: Something happened to make the client feel that they were in an environment that was intimidating, hostile, degrading, humiliating or offensive or that violated their dignity.
cy: Digwyddodd rhywbeth i'r cleient i wneud iddynt deimlo eu bod mewn amgylchedd a oedd yn fygythiol, gelyniaethus, diraddiol, darostyngol neu ymosodol neu wedi bradychu eu hurddas.

source: Victimisation due to a discrimination claim
cy: Cael eich erlid oherwydd honiad ynghylch gwahaniaethu

source: The client thinks that they have been treated worse, or disadvantaged in some way, because they have brought a claim of discrimination, given evidence or information in relation to someone else’s claim of discrimination, made a complaint of discrimination, or been suspected of doing one of these things. For example, an employee is dismissed after making a discrimination claim.
cy: Mae'r cleient yn credu ei fod wedi cael ei drin yn waeth, neu o dan anfantais mewn rhyw ffordd, oherwydd eu bod wedi gwneud hawliad am wahaniaethu, rhoi tystiolaeth neu wybodaeth mewn perthynas â hawliad rhywun arall am wahaniaethu, wedi gwneud cwyn am wahaniaethu, neu wedi cael ei ddrwgdybio o wneud un o'r rhain. Er enghraifft, gweithiwr yn cael ei ddiswyddo ar ôl gwneud hawliad am wahaniaethu.

source: Special educational needs (SEN) in a child or young person under 25 - client could be the parent or the child or young person
cy: Anghenion addysgol arbennig (SEN) mewn plentyn neu berson ifanc dan 25 - gallai'r cleient fod yn rhiant, neu'r plentyn neu berson ifanc ei hun

source: Advised to bring judicial review proceedings in an education matter
cy: Cynghorwyd i ddechrau achos am adolygiad barnwrol mewn perthynas â mater addysg

source: Discrimination may have occurred due to the child or young person’s SEN or other protected characteristic (eg a school excludes a disabled child from a school trip, a student is being bullied because they're gay but the school is taking no action)
cy: Gallai'r gwahaniaethu fod wedi digwydd oherwydd SEN y plentyn neu'r unigolyn ifanc neu nodwedd gwarchodedig arall (e.e. ysgol yn gwahardd plentyn anabl rhag mynd ar drip ysgol, myfyriwr yn cael ei fwlio oherwydd ei fod yn hoyw ond nid yw'r ysgol yn gwneud rhywbeth)

source: Search guidance for 'discrimination education' for more information and a list of questions to ask.
cy: Chwiliwch am 'addysg ar wahaniaethu' yn y canllaw i gael rhagor o wybodaeth a rhestr o gwestiynau i'w gofyn.

source: The client's problem is about admissions, exclusions, other disciplinary procedures, school trips, bullying, any problems at school caused by a child’s disability or any other similar situation
cy: Mae problem y cleient yn ymwneud ag addefiadau, gwaharddiadau, gweithdrefnau disgyblu eraill, tripiau ysgol, bwlio, unrhyw broblemau yn yr ysgol a achoswyd gan anabledd plentyn neu sefyllfa arall debyg

source: Any other education problem
cy: Unrhyw broblem arall yn ymwneud ag addysg

source: The client is a teacher or employee of the local authority
cy: Mae'r cleient yn athro neu'n gyflogai i'r awdurdod lleol

source: The client is calling for general advice, not about a legal issue specific to them (eg they want to know if a school can stop them removing their child, as opposed to calling after the school has taken action against them for removing their child)
cy: Mae'r cleient yn ffonio am gyngor cyffredinol, nid ynghylch mater cyfreithiol sy'n benodol iddynt hwy (e.e. maent eisiau gwybod os gall ysgol eu stopio rhag symud eu plentyn, yn hytrach na ffonio ar ôl i'r ysgol weithredu yn eu herbyn am symud eu plentyn)

source: The welfare benefits category of law covers advice on: * entitlement to benefits and help when benefits are refused * benefit appeals and tribunals * problems with housing, welfare and disability benefits and tax credits * advice on changes in circumstances that would affect benefits or tax credits The client's problem will be in scope for legal aid if: * they want to appeal a benefits decision on a point of law in the Upper Tribunal, Court of Appeal or Supreme Court * a first-tier tribunal has refused them permission to appeal a benefits decision in the Upper Tribunal, and they want advice about how to appeal this decision All other benefit problems are out of scope.
cy: Mae'r categori cyfraith budd-daliadau lles yn cynnwys cyngor am: * hawl i gael budd-daliadau a chymorth pan wrthodir budd-daliadau * apeliadau i fudd-daliadau a thribiwnlysoedd * problemau gyda budd-daliadau tai, lles ac anabledd a chredyd treth Bydd problem y cleient o fewn cwmpas ar gyfer cymorth cyfreithiol os: * ydynt eisiau apelio penderfyniad budd-daliadau ar bwynt cyfreithiol yn yr Uwch Dribiwnlys, y Llys Apêl neu'r Goruchaf Lys * mae tribiwnlys haen gyntaf wedi gwrthod caniatâd i apelio penderfyniad budd-daliadau yn yr Uwch Dribiwnlys, ac maent eisiau cyngor am sut i apelio'r penderfyniad hwn Mae pob problem arall y tu allan i'r cwmpas.

source: The client wants to appeal their benefits decision on a point of law in the Upper Tribunal, Court of Appeal or Supreme Court. (Or a first-tier tribunal has refused the client permission to appeal their benefits decision in the Upper Tribunal and they want advice about how to appeal this decision.)
cy: Mae'r cleient eisiau apelio yn erbyn penderfyniad ynghlych eu budd-daliadau ar bwynt cyfreithiol yn yr Uwch Dribiwnlys, y Llys Apêl neu'r Goruchaf Lys. (Neu mae tribiwnlys haen gyntaf wedi gwrthod caniatâd i'r cleient apelio yn erbyn penderfyniad a wnaed ynghlych eu budd-daliadau yn yr Uwch Dribiwnlys, ac maent eisiau cyngor ar sut i apelio yn erbyn y penderfyniad hwn.)

source: The employment category covers advice on * redundancies, dismissals and disciplinaries * contracts, workers' rights and working hours * rights at work including health &amp; safety and accidents at work * employment status * holidays, time off, sick leave, maternity &amp; paternity leave and other absence * pay, tax and the National Minimum Wage.
cy: Mae'r categori cyflogaeth yn cynnwys cyngor am * golli swydd, diswyddiadau a disgyblu * cytundebau, hawliau gweithwyr ac oriau gwaith * hawliau yn y gwaith gan gynnwys iechyd &amp; diogelwch a damweiniau yn y gwaith * statws cyflogaeth * gwyliau, amser i ffwrdd, absenoldeb salwch, mamolaeth &amp; absenoldeb tadolaeth ac absenoldebau eraill * tâl, treth ac Isafswm Cyflog Cenedlaethol.

source: The client may have been discriminated against (eg employer not making reasonable adjustments for a disability)
cy: Mae'n bosib bod y cleient wedi profi gwahaniaethu (e.e. nid oedd cyflogwr yn gwneud addasiadau rhesymol ar gyfer anabledd)

source: More examples of discrimination issues include issues around: * equal pay * being treated worse due to pregnancy or maternity leave * sexual harassment in the workplace * being victimised due to having made a claim of discrimination in the workplace
cy: Rhagor o enghreifftiau o faterion gwahaniaethu yn cynnwys materion am: * dâl cyfartal * cael eu trin yn waeth oherwydd beichiogrwydd neu gyfnod mamolaeth * aflonyddu rhywiol yn y gweithle * cael cam oherwydd eu bod wedi honni bod gwahaniaethu wedi digwydd yn y gweithle

source: Discrimination does not apply (Confirm no other matters such as homelessness arise as a result of employment issue)
cy: Nid yw gwahaniaethu yn berthnasol (Cadarnhau nad oes materion eraill megis digartrefedd yn codi o ganlyniad i broblem cyflogaeth)

source: Consumer
cy: Defnyddiwr

source: The key thing to determine in this category is whether the client has been discriminated against. Discrimination cases will be in scope. All other consumer cases will be out of scope.
cy: Y peth allweddol i benderfynu yn ei gylch yn y categori hwn yw pa un ai a brofodd y cleient wahaniaethu ai peidio. Bydd achosion gwahaniaethu o fewn y cwmpas. Bydd holl achosion eraill yn ymwneud â defnyddwyr y tu allan i'r cwmpas.

source: The client may have been discriminated against
cy: Mae'n bosib bod y cleient wedi profi gwahaniaethu

source: Discrimination does not apply
cy: Nid yw gwahaniaethu yn berhtnasol

source: Claims against public authorities
cy: Camau yn erbyn yr heddlu

source: The key thing to determine in claims against public authorities is whether the client has been discriminated against. If the client says they have been discriminated against, or if you pick up that they have been discriminated against from what they say, select 'The client has been discriminated against' on the next screen to proceed to the discrimination flow.
cy: Y peth allweddol i benderfynu yn ei gylch o ran camau yn erbyn yr heddlu yw pa un ai a brofodd y cleient wahaniaethu. Os yw'r cleient yn dweud ei fod wedi profi gwahaniaethu, neu eich bod yn sylweddoli eu bod wedi profi gwahaniaethu o'r hyn y maent yn ei ddweud, dewiswch 'Mae'r cleient wedi profi gwahaniaethu' ar y sgrin nesaf i barhau i'r llif gwahaniaethu.

source: The client has been discriminated against (eg a police officer used racially abusive language when making an arrest)
cy: Mae'r cleient wedi profi gwahaniaethu (h.y. heddwas wedi defnyddio iaith ddifrïol ar sail hil wrth arestio)

source: Crime
cy: Trosedd

source: Signpost clinical negligence cases to face-to-face providers in the client's area. Generally, only cases that relate to infants with a brain injury are in scope for legal aid but it's possible that other cases may qualify for exceptional case funding.
cy: Cyfeirio achosion esgeuluster clinigol i ddarparwyr wyneb yn wyneb yn ardal y cleient. Yn gyffredinol, dim ond achosion sy'n berthnasol i blant bach ag anaf i'r ymenydd sydd o fewn cwmpas am gymorth cyfreithiol, ond mae'n bosibl y gall achosion eraill fod yn gymwys am gyllid i achosion arbennig.

source: Any other matter
cy: Unrhyw fater arall

source: The client is losing their home due to the Border Force refusing to support them or withdrawing their support
cy: Mae'r cleient yn colli eu cartref oherwydd bod Llu'r Ffiniau yn gwrthod eu cefnogi neu yn tynnu eu cefnogaeth yn ôl

source: The key thing to determine in this category is whether the client has been discriminated against. Discrimination cases will be in scope. All other personal injury cases will be out of scope.
cy: Y peth allweddol yn y categori hwn yw pa un ai a brofodd y cleient wahaniaethu ai peidio. Bydd achosion o wahaniaethu o fewn y cwmpas. Bydd yr holl achosion anaf personol eraill y tu allan i'r cwmpas.

source: The client has been discriminated against
cy: Mae'r cleient wedi profi gwahaniaethu

source: Client in rented accomodation
cy: Cleient mewn llety rhent

source: Client is homeowner
cy: Cleient yn berchennog tŷ

source: None of the above apply
cy: Nid oes un o'r uchod yn berthnasol

source: Client does not have BOTH evidence of the disrepair AND reason to believe the disrepair poses a serious risk of harm, injury or illness to them or their family
cy: Nid oes gan y cleient y DDAU, sef tystiolaeth o'r diffyg atgyweirio A'R rheswm dros gredu bod y diffyg atgyweirio yn peri risg o niwed, anaf neu salwch difrifol iddynt hwy neu eu teulu.

source: Client is the alleged abusive partner and wants to defend an injunction. This will be in scope for Civil Legal Advice.
cy: Y cleient yw'r partner camdriniol honedig ac mae eisiau amddiffyn gwaharddeb. Bydd hyn o fewn y cwmpas i gael Cyngor Cyfreithiol Sifil.

source: Where a Client wants to seek a court order to protect themselves or a child from abuse via a court order 'an injunction' that tells a person they're not allowed to do a certain act. There are two main forms of injunction * A non-molestation order - aimed at preventing your partner or ex-partner from using or threatening violence against you or your child, or intimidating, harassing or pestering you, in order to ensure the health, safety and well-being of yourself and your children. * An occupation order can aimed at deciding who can live in the family home, and can also restrict your abuser from entering the surrounding area. If you do not feel safe continuing to live with your partner, or if you have left home because of violence, but want to return and exclude your abuser, you may want to apply for an occupation order. Some clients who are the alleged abuser do not agree with the injunction against them and wish to get help in defending themselves against it.
cy: Pan fo Cleient eisiau ceisio am orchymyn llys i ddiogelu eu hunain neu blentyn rhag cam-drin drwy orchymyn llys sef 'gwaharddeb' sy'n dweud wrth unigolyn nad oes ganddynt hawl i wneud gweithred bendodol. Mae dau brif fath o waharddeb: * Gorchymyn rhag molestu - wedi ei fwriadu i atal eich partner neu gyn-bartner rhag defnyddio neu fygwth defnyddio trais yn eich erbyn neu eich plentyn, neu eich bygwth, aflonyddu neu eich poeni, er mwyn sicrhau iechyd, diogelwch a lles eich hunain a'ch plant. * Gall gorchymyn anheddu olygu gwneud penderfyniad ynghylch pwy all fyw yng nghartref y teulu, a hefyd gall gyfyngu eich camdriniwr rhag dod i'r ardal gyfagos. Os nad ydych yn teimlo'n ddiogel i barhau i fyw gyda'ch partner, neu eich bod wedi gadael eich cartref oherwydd trais, ond eisiau dychwelyd a chau eich camdriniwr allan, efallai y dylech wneud cais am orchymyn anheddu. Nid yw rhai cleientiaid sy'n gamdriniwyr honedig yn cytuno ar y waharddeb yn eu herbyn ac yn dymuno cael cymorth i'w hamddiffyn eu hunain yn ei erbyn.

source: The client is being harassed by a partner, ex-partner or family member
cy: Mae partner, cyn-bartner neu aelod o'r teulu yn achosi aflonyddwch i'r cleient.

source: Seeking protection from a partner, ex partner or other family member due to a fear of violence or unwanted behaviour which is causing them alarm or distress. Also covers client who have previously taken action to stop harassment (i.e. sought an injunction) but this is not being complied with.
cy: Ceisio cael eu hamddiffyn rhag eu partner, cyn-bartner neu aelod arall o'r teulu oherwydd eu bod yn ofni trais neu ymddygiad annymunol sy'n achosi braw neu drallod iddynt. Mae hefyd yn cynnwys cleient sydd wedi cymryd camau i stopio aflonyddwch yn flaenorol (h.y. wedi ceisio am waharddeb) ond nid ydynt yn cydymffurfio.

source: The client's problem is about admissions
cy: Mae problem y cleient ynglŷn ag addefiadau

source: The client's problem is about bullying, and none of the other issues above apply
cy: Bwlio yw problem y cleient, ac nid yw'r un o'r uchod yn berthnasol

source: A child or young person is out of school or in a Pupil Referral Unit, or is not receiving full-time education
cy: Nid yw plentyn neu unigolyn ifanc yn yr ysgol, maent mewn Uned Cyfeirio Disgyblion, neu nid ydynt yn cael addysg llawn amser

source: The client's problem is about exclusion from school
cy: Mae problem y cleient ynghylch gwaharddiad o'r ysgol

source: The client's problem is about further education
cy: Addysg pellach yw problem y cleient

source: The problem is about a school, college or local authority's failure to provide for a child or young person's educational needs, or specifically about the failure to provide the support set out in the assessment of their needs
cy: Mae'r broblem ynghylch methiant ysgol, coleg neu awdurdod lleol i ddarparu ar gyfer anghenion addysgol plentyn neu unigolyn ifanc, neu'n benodol am y methiant i ddarparu'r gefnogaeth a nodir yn yr asesiad o'u hanghenion.

source: The client's problem is about higher education
cy: Addysg pellach yw problem y cleient

source: The client's problem is about transport
cy: Trafnidiaeth yw problem y cleient

source: Any other issue
cy: Unrhyw fater arall

source: The client is enquiring about an application or admissions appeal in the normal admissions round (ie reception and secondary school transfers)
cy: Mae'r cleient yn holi ynghylch cais neu apêl addefiadau yn y rownd addefiadau arferol (h.y. trosglwyddiadau derbyn ac ysgol uwchradd)

source: Negligence in the provision of education
cy: Esgeuluster mewn perthynas â darpariaeth addysg

source: The client's problem relates to special needs not being met properly for a child of compulsory school age, or a young person in compulsory or further education
cy: Mae problem y cleient yn ymwneud ag anghenion arbennig sydd ddim yn cael eu bodloni'n iawn i blentyn mewn oedran ysgol gorfodol, neu unigolyn ifanc mewn addysg orfodol neu uwch

source: There has been a formal fixed term exclusion from school (a suspension) of up to five days and the child has not received more than one other fixed term exclusion in the last school year
cy: Cafwyd gwaharddiad cyfnod penodol ffurfiol o'r ysgol (gwaharddiad dros dro) hyd at bum niwrnod, ac nid yw'r plentyn wedi cael mwy nac un gwaharddiad cyfnod penodol arall yn y flwyddyn ysgol ddiwethaf

source: The client's problem is about SEN, transport, admissions or exclusions
cy: Mae problem y cleient ynghylch SEN, trafnidiaeth, addefiadau neu waharddiadau

source: The client's problem is about fees or funding
cy: Mae problem y cleient yn ymwneud â ffioedd neu gyllid

source: The client's problem is about exclusion - but not for failure at exams or malpractice allegations eg plagiarism
cy: Mae problem y cleient yn ymwneud â gwaharddiad - nid am fethu yn yr arholiadau neu honiadau camymddwyn e.e. llên-ladrad

source: This refers to: * pregnancy * having recently given birth (and can include the need to breastfeed)
cy: Mae hyn yn cyfeirio at y canlynol: * beichiogrwydd * wedi rhoi genedigaeth yn ddiweddar (a gall gynnwys yr angen i fwydo ar y fron)

source: Race refers to a group of people defined by their race, colour, nationality (including citizenship), ethnic or national origins.
cy: Mae hil yn cyfeirio at grŵp o bobl sy'n cael eu diffinio gan eu hil, lliw, cenedligrwydd (gan gynnwys dinasyddiaeth), tarddiad ethnig neu wlad.

source: Religion or belief (or lack of belief)
cy: Crefydd neu gred (neu ddiffyg cred)

source: Religion refers to any religious or philosophical belief. This also includes a lack of religious belief (eg atheism). Generally, a belief should affect your life choices or the way you live for it to be included in the definition.
cy: Mae crefydd yn cyfeirio at unrhyw gred grefyddol neu athronyddol. Mae hyn hefyd yn cynnwys diffyg cred grefyddol (e.e. anffyddiaeth). Yn gyffredinol, dylai cred effeithio ar eich dewisiadau mewn bywyd, neu'r ffordd yr ydych yn byw iddo gael ei gynnwys yn y diffiniad.

source: Sex
cy: Rhyw

source: Sexual orientation
cy: Cyfeiriadedd Rhywiol

source: Sexual orientation is whether a person's sexual attraction is towards their own sex, the opposite sex or to both sexes. This can also cover situations where discrimination is based on perceived sexual orientation, which may not be the case.
cy: Cyfeiriadedd rhywiol yw pan mae atyniad rhywiol unigolyn tuag at ei ryw ei hun, y rhyw arall neu'r ddau ryw. Gall hyn ymdrin â sefyllfaoedd lle mae gwahaniaethu wedi'i seilio ar gyfeiriadedd rhywiol ymddangosiadol, ond efallai nid fel yna mae hi.

source: Gender reassignment
cy: Ailbennu rhywedd

source: It is unlawful to discriminate against someone due to their gender reassignment. This includes where someone is: * is proposing to undergo gender reassignment * is currently undergoing gender reassignment * has already undergone (or partially undergone) the process of gender reassignment
cy: Mae'n anghyfreithlon i wahaniaethu yn erbyn rhywun oherwydd ailbennu rhywedd. Mae hyn yn cynnwys pan fydd rhywun: * yn bwriadu cael triniaeth ailbennu rhywedd * yn cael triniaeth ailbennu rhywedd ar hyn o bryd * wedi bod drwy (neu wedi mynd drwy'n rhannol) y broses ailbennu rhywedd yn barod

source: Disability or failure to make reasonable adjustments for a disabled person
cy: Anabledd neu fethiant i wneud addasiadau rhesymol ar gyfer unigolyn anabl

source: The client has been identified as homeless through a Community Care Assessment
cy: Mae'r cleient wedi cael ei ddynodi'n ddigartref drwy Asesiad Gofal Cymunedol

source: The client has not been identified as homeless through a Community Care Assessment
cy: Nid yw'r cleient wedi cael ei ddynodi'n ddigartref drwy Asesiad Gofal Cymunedol

source: Client wants advice about international family maintenance
cy: Mae'r cleient eisiau cyngor am gynhaliaeth teuluol rhyngwladol

source: Covers enforcement of maintenance orders made outside the UK. Clients who have obtained maintenance orders in one country can apply to have them registered and enforced in another country. So where a client wants to obtain an order outside the UK this will not be in scope. **NOTE: These are very unusual cases.**
cy: Mae'n ymdrin â gorchmynion gorfodi cynhaliaeth a wneir y tu allan i'r DU. Gall cleientiaid sydd wedi cael gorchmynion cynhaliaeth mewn un wlad wneud cais i'w cofrestru a'u gorfodi mewn gwlad arall. Felly pan fydd cleient yn cael gorchymyn y tu allan i'r DU, ni fydd hyn o fewn cwmpas. ** NODYN: Mae'r rhain yn achosion anghyffredin iawn.

source: Not a Civil Legal Advice category or legal problem.
cy: Nid yw'n gategori Cyngor Cyfreithiol Sifil nac yn broblem gyfreithiol

source: IMPORTANT: Where a client or a child is AT IMMEDIATE RISK OF ABUSE you must follow the Civil Legal Advice Child, Young Person and Adult at Risk of Abuse Policy. You may need to report the matter to protection services. *Click 'Next' to continue*
cy: PWYSIG: Lle bo cleient neu blentyn mewn PERYGL UNIONGYRCHOL O GAMDRINIAETH, mae'n rhaid i chi ddilyn y Polisi Cyngor Cyfreithiol Sifil ar gyfer Plentyn, Unigolyn Ifanc ac Oedolyn sydd mewn Perygl o Gamdriniaeth. Efallai bydd angen i chi adrodd y mater i'r gwasanaethau diogelu. * Cliciwch 'Nesaf' i barhau*

source: Legal advice in support of family mediation
cy: Cyngor cyfreithiol i gefnogi cyfryngu teuluol
