Repository: ministryofjustice/cla_backend
Catalog: cla_backend/translations/*/LC_MESSAGES/django.po
Languages: cy

source: Clinical negligence
cy: Esgeuluster clinigol

source: Problems with your medical care and treatment
cy: Problemau gyda'ch gofal meddygol a thriniaeth

source: Community care
cy: Gofal cymunedol

source: You’re unhappy with the care you or a relative are getting due to disability, age or special educational needs eg in a care home or your own home
cy: Nid ydych chi’n fodlon ar y gofal sy’n cael ei ddarparu i chi neu i berthynas oherwydd anabledd, oed neu anghenion addysgol arbennig - er enghraifft, mewn cartref gofal neu yn eich cartref eich hun

source: Debt
cy: Dyled

source: Bankruptcy, repossession, mortgage debt that is putting your home at risk
cy: Methdaliad, adfeddiannu, dyled morgais sy’n rhoi eich cartref mewn perygl

source: Choose the option that best describes your debt problem
cy: Dewiswch yr opsiwn sy'n disgrifio orau eich problem dyled

source: Domestic abuse
cy: Cam-drin domestig

source: Abuse at home (psychological, physical, financial, sexual or emotional), child abuse, harassment by an ex-partner, forced marriage
cy: Cam-drin yn y cartref (naill ai'n seicolegol, corfforol, ariannol, rhywiol neu emosiynol), cam-drin plant, aflonyddwch gan gyn-bartner, priodas dan orfod

source: Choose the option that best describes your personal situation
cy: Dewiswch yr opsiwn sy'n disgrifio orau eich sefyllfa bersonol

source: Discrimination
cy: Gwahaniaethu

source: Being treated unfairly because of eg your race, gender or sexual orientation
cy: Cael eich trin yn annheg oherwydd eich hil, rhyw, cyfeiriadedd rhywiol

source: On what grounds have you been discriminated against?
cy: Ar ba sail y gwahaniaethwyd yn eich erbyn?

source: Education
cy: Addysg

source: Special educational needs, problems with school places, exclusions, learning difficulties
cy: Anghenion addysgol arbennig, problemau â lleoedd mewn ysgolion, gwahardd o’r ysgol, anawsterau dysgu

source: What is your education problem about?
cy: Beth yw eich problem ynglŷn ag addysg?

source: Employment
cy: Cyflogaeth

source: Being treated unfairly at work, unfair dismissal, employment tribunals
cy: Cael eich trin yn annheg yn y gwaith, diswyddo annheg, tribiwnlysoedd cyflogaeth

source: What is your employment problem about?
cy: Beth yw eich problem ynglŷn â chyflogaeth?

source: Housing
cy: Tai

source: Eviction, homelessness, losing your rented home, rent arrears, harassment by a landlord or neighbour, health and safety issues with your home
cy: Troi allan, digartrefedd, colli cartref wedi’i rentu, ôl-ddyledion rhent, aflonyddu gan landlord neu gymydog, materion iechyd a diogelwch sy’n ymwneud â’ch cartref.

source: Choose the option that best describes your housing situation
cy: Dewiswch yr opsiwn sy'n disgrifio orau eich sefyllfa tai

source: Immigration and asylum
cy: Mewnfudo a lloches

source: Applying for asylum or permission to stay in the UK, including for victims of human trafficking
cy: Gwneud cais am loches neu ganiatâd i aros yn y DU, gan gynnwys dioddefwyr masnachu mewn pobl

source: Choose the option that best describes your situation
cy: Dewiswch yr opsiwn sy'n disgrifio eich sefyllfa orau

source: Mental health
cy: Iechyd meddwl

source: Help with mental health and mental capacity legal issues
cy: Help gyda materion cyfreithiol sy’n ymwneud ag iechyd meddwl a galluedd meddyliol

source: Personal injury
cy: Anaf personol

source: An accident that was not your fault
cy: Damwain lle nid chi oedd ar fai

source: Public law
cy: Cyfraith gyhoeddus

source: Taking legal action against a public body, like your local council
cy: Cymryd camau cyfreithiol yn erbyn corff cyhoeddus, fel y cyngor lleol

source: Trouble with the police and other public authorities
cy: Trafferth gyda'r heddlu ac awdurdodau cyhoeddus eraill

source: You’ve been treated wrongly by the police or other authorities with the power to detain, imprison or prosecute you
cy: Rydych wedi cael cam gan yr heddlu neu awdurdod arall sydd â phwer i'ch cadw, eich carcharu neu eich erlyn

source: Welfare benefits
cy: Budd-daliadau lles

source: Problems with your benefits, appealing a decision about your benefits
cy: Problemau gyda'ch budd-daliadau, apelio penderfyniad ynghylch eich budd-daliadau

source: What is your benefits problem about?
cy: Beth yw eich problem ynglŷn â budd-daliadau?

source: Family
cy: Teulu

source: Divorce, separation, dissolution, financial arrangements, family mediation, arrangements for your children, children being taken into care, child abduction
cy: Ysgariad, gwahaniad, diddymiad, trefniadau ariannol, cyfryngu teuluol, trefniadau ar gyfer eich plant, plant yn cael eu rhoi mewn gofal, herwgydio plentyn

source: What is your family problem about?
cy: Beth yw eich problem teuluol?

source: Any other problem
cy: Unrhyw broblem arall

source: What is your problem about?
cy: Beth yw eich problem?

source: You’re a home owner, and you’re at risk of losing your home due to bankruptcy, mortgage debt or repossession
cy: Rydych yn berchen ar eich cartref eich hun, ac rydych mewn perygl o golli eich cartref oherwydd methdaliad, dyled morgais neu ailfeddiannu

source: You owe money (for example, bank loans, credit card debt) but this is not putting your home at risk
cy: Rydych chi mewn dyled (er enghraifft, benthyciadau banc, dyled cardiau credyd) ond nid yw hyn yn rhoi eich cartref mewn perygl

source: Choose one of the options
cy: Dewiswch un o'r opsiynau

source: Yes
cy: Ie

source: No
cy: Na

source: Benefits appeal
cy: Apêl budd-daliadau

source: You want to appeal a decision about your benefits
cy: Rydych eisiau apelio yn erbyn penderfyniad ynglŷn â'ch budd-daliadau

source: You want to appeal a benefits decision:
cy: Rydych eisiau apelio yn erbyn penderfyniad ynglŷn â budd-daliadau:

source: Permission to appeal refused
cy: Gwrthodwyd caniatâd i apelio

source: A first-tier tribunal has refused you permission to appeal your benefits decision in the Upper Tribunal and you want advice about how to appeal this decision
cy: Mae tribiwnlys haen gyntaf wedi gwrthod rhoi caniatâd i chi apelio penderfyniad eich budd-daliadau yn yr Uwch Dribiwnlys, ac rydych eisiau cyngor ynghylch sut i apelio'r penderfyniad hwn

source: None of the above
cy: Dim o'r uchod

source: Age
cy: Oed

source: How old are you?
cy: Faint yw eich oed?

source: Disability
cy: Anabledd

source: Where did the discrimination occur?
cy: Ym mhle ddigwyddodd y gwahaniaethu?

source: Gender, gender reassignment or sexual orientation
cy: Rhyw, ailbennu rhywedd neu chyfeiriadedd rhywiol

source: Marriage or civil partnership
cy: Priodas neu bartneriaeth sifil

source: Pregnancy or maternity
cy: Beichiogrwydd neu famolaeth

source: Race
cy: Hil

source: Including nationality, citizenship, ethnicity or national origin
cy: Gan gynnwys cenedligrwydd, dinasyddiaeth, ethnigrwydd neu darddiad cenedlaethol

source: Religion, belief, or lack of religion or belief
cy: Crefydd, cred neu ddiffyg crefydd neu gred

source: At work
cy: Yn y gwaith

source: While you were using a service
cy: Tra roeddech yn defnyddio gwasanaeth

source: For example, having a meal in a restaurant or getting access to a shop
cy: Er enghraifft, wrth gael pryd o fwyd mewn bwyty neu yn mynd i mewn i siop

source: In an association
cy: Mewn cymdeithas

source: For example, a private club or political organisation
cy: Er enghraifft, clwb preifat neu fudiad gwleidyddol

source: When someone was carrying out a public function
cy: Tra roedd rhywun yn cynnal gweithred gyhoeddus

source: For example, a police officer carrying out a search as part of a criminal investigation
cy: Er enghraifft, heddwas yn cynnal chwiliad fel rhan o ymchwiliad troseddol

source: At school or college
cy: Yn yr ysgol neu goleg

source: At university
cy: yn y brifysgol

source: Or other further education or higher education institution
cy: Neu sefydliad addysg bellach neu addysg uwch arall

source: 18 or over
cy: 18 neu hŷn

source: Under 18
cy: Dan 18

source: A child in care or a care leaver - or you are a foster carer
cy: Plentyn mewn gofal neu un sy'n gadael gofal - neu a ydych chi'n ofalwr maeth

source: Special educational needs
cy: Anghenion addysgol arbennig

source: You have (or your child has) special educational needs - this includes problems about transport, being out of school or being in a pupil referral unit
cy: Mae gennych chi (neu mae gan eich plentyn) anghenion addysgol arbennig - mae hyn yn cynnwys problemau mewn perthynas â thrafnidiaeth, peidio â bod mewn ysgol neu bod mewn uned cyfeirio disgyblion

source: For example admissions or exclusions
cy: Er enghraifft addefiad neu gau allan

source: You want to protect yourself or your children against domestic abuse (including psychological, physical, financial, sexual or emotional abuse)
cy: Rydych chi eisiau diogelu eich hun neu eich plant yn erbyn cam-drin domestig (gan gynnwys cam-drin seicolegol, corfforol, rhywiol neu emosiynol)

source: Are you or your children at immediate risk of harm?
cy: Ydych chi neu eich plant mewn perygl uniongyrchol o niwed?

source: Enforcing an injunction
cy: Gorfodi gwaharddeb

source: Your partner or ex-partner is ignoring an injunction you have taken out against them
cy: Mae eich partner neu gyn-bartner yn anwybyddu gwaharddeb sydd gennych yn eu herbyn

source: Are you at immediate risk of harm?
cy: Ydych chi mewn perygl uniongyrchol o niwed?

source: Harassment
cy: Aflonyddwch

source: You are being harassed by a partner, ex-partner or family member
cy: Rydych yn cael eich aflonyddu gan bartner, cyn-bartner neu aelod o'r teulu

source: Contesting an injunction
cy: Herio gwaharddeb

source: You want to contest an injunction that has been taken out against you
cy: Rydych eisiau herio gwaharddeb sydd yn eich erbyn

source: Forced marriage
cy: Priodas dan Orfod

source: You want advice about forced marriage
cy: Rydych eisiau cyngor ynghylch priodi dan orfod

source: Children being taken into care and adoption
cy: Plant yn cael eu rhoi mewn gofal neu fabwysiadu

source: Your local council is involved
cy: Mae eich cyngor lleol yn ymwneud â'ch achos

source: Is the local council trying to take your child into care?
cy: Yw'r cyngor lleol yn ceisio rhoi eich plentyn mewn gofal?

source: Child abduction
cy: Herwgydio plentyn

source: You want advice about child abduction
cy: Rydych eisiau cyngor ynghylch herwgydio plentyn

source: Select the option that best describes your situation
cy: Dewiswch yr opsiwn sy'n disgrifio eich sefyllfa orau

source: Divorce, separation or dissolution
cy: Ysgariad, gwahaniad neu ddiddymiad

source: Financial settlement
cy: Setliad ariannol

source: Following a divorce or separation
cy: Yn dilyn ysgariad neu wahaniad

source: Family mediation
cy: Cyfryngu Teuluol

source: You’re looking to start family mediation or you’re seeking legal advice in support of it
cy: Rydych yn ystyried dechrau cyfryngu teuluol neu'n ceisio am gyngor cyfreithiol i'w gefnogi

source: Have you taken part in a family mediation session?
cy: Ydych chi wedi cymryd rhan mewn sesiwn cyfryngu i deuluoedd?

source: You are under 18
cy: Rydych chi dan 18 oed

source: International Family Maintenance
cy: Cynhaliaeth Plant Rhynglwadol

source: You’re seeking advice about International Family Maintenance, to enforce a maintenance order made outside the UK
cy: Rydych yn ceisio am gyngor ynglŷn â Chynhaliaeth Plant - Rhyngwladol, i orfodi gorchymyn cynhaliaeth a wnaethpwyd y tu allan i'r DU

source: You’re living in rented accommodation
cy: Rydych chi'n byw mewn llety rhent

source: What is your housing problem about?
cy: Beth yw eich problem ynglŷn â thai?

source: You are homeless
cy: Rydych chi'n ddigartref

source: Any other housing problem
cy: Unrhyw broblem arall yn ymwneud â thai

source: Becoming homeless
cy: Mynd yn ddigartref

source: You are at risk of becoming homeless within 56 days and you want to make an application to your local council to stop your home being taken away from you
cy: Rydych chi mewn perygl o fynd yn ddigartref o fewn 56 diwrnod a'ch bod eisiau gwneud cais i'ch cyngor lleol i atal eich cartref rhag cael ei gymryd oddi wrthych chi

source: Eviction
cy: Troi allan

source: You are being evicted from your home
cy: Rydych chi'n cael eich troi allan o'ch cartref

source: Your landlord or neighbour is harassing you
cy: Mae eich landlord neu gymydog yn aflonyddu arnoch chi

source: Contesting an injunction for antisocial behaviour
cy: Herio gwaharddeb am ymddygiad gwrthgymdeithasol

source: Your landlord has taken out an injunction against you or someone who lives with you
cy: Mae eich landlord wedi cael gwaharddeb yn eich erbyn chi neu rywun sy'n byw gyda chi

source: Your landlord is:
cy: Eich landlord yw:

source: Problem relates to a child in care, or a care leaver, or user is a foster carer
cy: Problem ynghylch plentyn mewn gofal, neu blentyn yn gadael gofal, neu fod y defnyddiwr yn ofalwr maeth

source: Council is trying to take user’s child into care
cy: Cyngor yn ceisio rhoi plentyn y defnyddiwr mewn gofal

source: User is at immediate risk of harm
cy: Mae'r defnyddiwr mewn perygl uniongyrchol o niwed

source: User is under 18 years old
cy: Defnyddiwr dan 18 oed

source: User is living outside the UK but user’s child has been taken to the UK
cy: Mae'r defnyddiwr yn byw y tu allan i'r DU ond aethpwyd â phlentyn y defnyddiwr i'r DU

source: Losing your accommodation
cy: Colli eich llety

source: You’re losing your accommodation because UK Visas and Immigration (UKVI) is refusing to support you or is withdrawing its support from you
cy: Rydych yn colli eich llety oherwydd bod Fisâu a Mewnfudo y DU (UKVI) yn gwrthod eich cefnogi neu'n tynnu eu cefnogaeth yn ôl

source: You want advice on seeking asylum or appealing a decision about your asylum
cy: Rydych eisiau cyngor am geisio lloches neu apelio yn erbyn penderfyniad ynglŷn â'ch lloches

source: You’re a victim of domestic violence
cy: Rydych chi'n ddioddefwr trais domestig

source: Your home is in a serious state of disrepair
cy: Mae eich cartref mewn cyflwr adfeiliedig difrifol

source: Does this create a serious risk of illness or injury?
cy: A yw hyn yn creu perygl difrifol o salwch neu anaf?

source: You own your own home
cy: Rydych chi'n berchen ar eich cartref eich hun

source: Are you at risk of losing your home because of bankruptcy, repossession or mortgage debt?
cy: Ydych chi mewn perygl o golli eich cartref oherwydd methdaliad, ailfeddiannu neu ddyled morgais?

source: A neighbour
cy: Cymydog

source: Domestic abuse or harassment
cy: Cam-drin domestig neu aflonyddwch

source: Abuse at home (including psychological, physical, financial, sexual or emotional abuse), child abuse, harassment
cy: Cam-drin yn y cartref (gan gynnwys cam-drin seicolegol, corfforol, ariannol, rhywiol neu emosiynol), cam-drin plant, aflonyddwch

source: Female genital mutilation
cy: Anffurfio organau cenhedlu benywod

source: You’re worried that you may become a victim of female genital mutilation
cy: Rydych chi'n poeni y gallwch ddod yn ddioddefwr anffurfio organau cenhedlu benywod

source: Disputes over children
cy: Anghydfod ynghylch plant

source: What kind of dispute is it?
cy: Pa fath o anghydfod ydyw?

source: You’re in a dispute with your ex-partner over your children
cy: Rydych chi mewn anghydfod gyda'ch cyn-bartner ynghylch eich plant

source: You’re a relative (for example, a grandparent) seeking contact with a child in your family
cy: Rydych chi'n berthynas (er enghraifft, taid neu nain) yn ceisio am gyswllt gyda phlentyn yn eich teulu

source: Is the child a victim of child abuse within the family?
cy: A yw'r plentyn yn ddioddefwr cam-drin plant o fewn y teulu?

source: Other
cy: Arall

source: At home (in rented accommodation)
cy: Gartref (mewn llety rhent)

source: You’re an asylum seeker applying for accommodation
cy: Rydych yn geisydd lloches sy'n ceisio am lety

source: You’re living in rented accommodation and you’re being evicted because of a debt to your landlord
cy: Rydych yn byw mewn llety rhent ac rydych yn cael eich troi allan oherwydd dyled i'ch landlord

source: Any other problem to do with divorce, separation or dissolution
cy: Unrhyw broblem arall sy'n ymwneud ag ysgaru, gwahanu neu ddiddymu

source: You’re a victim of human trafficking or modern slavery
cy: Rydych yn ddioddefwr masnachu pobl neu gaethwasiaeth fodern

source: On a point of law in the Upper Tribunal, Court of Appeal or Supreme Court
cy: Ar bwynt cyfreithiol yn yr Uwch Dribiwnlys, y Llys Apêl neu'r Goruchaf Lys

source: In the first-tier tribunal
cy: Yn y tribiwnlys haen gyntaf

source: A social housing landlord
cy: Landlord tai cymdeithasol

source: For example, housing association, council housing
cy: Er enghraifft, cymdeithas dai, tai cyngor

source: A private landlord
cy: Landlord preifat

source: You need advice about being a victim of abuse as a child or vulnerable adult (or on behalf of a victim)
cy: Mae arnoch angen cyngor ynghylch bod yn ddioddefwr cam-drin pan roeddech yn blentyn neu'n oedolyn bregus (neu ar ran y dioddefwr)

source: You’ve been barred, or are being barred, from working with children or vulnerable adults and you want to appeal
cy: Rydych wedi cael eich atal, neu'n cael eich atal rhag gweithio â phlant neu oedolion bregus, ac rydych am apelio

source: Someone has applied for a gang injunction against you
cy: Mae rhywun wedi gwneud cais am waharddeb criw yn eich erbyn

source: Someone has applied for an injunction for antisocial behaviour against you or someone you live with
cy: Mae rhywun wedi gwneud cais am waharddeb ymddygiad gwrthgymdeithasol yn eich erbyn chi neu rywun sy'n byw gyda chi

source: You need advice about being the victim of a sexual offence (or on behalf of a victim)
cy: Mae arnoch angen cyngor ynghylch bod yn ddioddefwr trosedd rhywiol (neu ar ran dioddefwr)

source: You need advice about an inquest into the death of a family member
cy: Mae arnoch angen cyngor am gwêst i farwolaeth aelod o'r teulu

source: You’re seeking an injunction because of nuisance caused by environmental pollution
cy: Rydych yn ceisio cael gwaharddeb oherwydd niwsans a achoswyd gan lygredd amgylcheddol

source: The education category of law covers all issues arising out of education including: * Special Educational Needs (SEN) * learning difficulties * discrimination in the provision of education * admissions * exclusions * bullying * children being out of school Please note education covers nursery education, primary, secondary and higher education as well as home schooling, training and apprenticeships.
cy: Mae categori addysg o'r gyfraith yn ymdrin â'r holl faterion sy'n codi o addysg gan gynnwys: * Anghenion Addysgol Arbennig (SEN) * anawsterau dysgu * gwahaniaethu yn narpariaeth addysg * addefiadau * cau allan * bwlio * plant ddim yn yr ysgol Sylwch fod addysg yn cynnwys addysg yn y feithrinfa, addysg cynradd, addysg uwchradd ac addysg uwch yn ogystal ag addysg gartref, hyfforddiant a phrentisiaethau.

source: Diagnosis for operators
cy: Diagnosis i'r gweithredwyr

source: Debt and housing - loss of home
cy: Dyled a thai - colli cartref

source: This category covers the legal area of Debt, and the areas of Housing covering home loss. Debt covers advice on * struggling to manage/pay debt * council tax, housing or mortgage arrears * dealing with creditors, loan sharks and illegal money lenders * Debt Relief Orders, Individual Voluntary Arrangements (IVA), Bankruptcy and Administration * dealing with bailiffs and charges placed on perperty in lieu of unpaid debt * being in receipt of a claim from the court * being subject to non-conformity of creditors from previous agreements * dealing with payment of court fines Housing covers advice on * homelessness * notices for eviction * illegal eviction or possession * notices for possession * rent arrears * UKBA issues The following are covered in 'other housing'. * threatened loss of home or harassment from landlords * disrepair / poor housing conditions * ASBO/ASBI Clients in temporary accommodation will be covered for in scope housing.
cy: Mae'r categori hwn yn ymdrin â maes cyfreithiol Dyled, a meysydd Tai sy'n ymdrin â cholli cartref. Mae cyngor am ddyled yn cynnwys * cael trafferth rheoli/talu dyled * y dreth gyngor, tai ac ôl-ddyledion morgais * delio â chredydwyr, benthycwyr arian didrwydded a benchycwyr arian anghyfreithlon * Gorchymyn Rhyddhad Dyled, Trefniadau Gwirfoddol Unigol (IVA), Methdaliad a Gweinyddiaeth * delio â beiliaid a chostau a roddir ar eiddo yn lle dyledion heb eu talu * derbyn hawliad gan y llys * bod yn destun anghydffurfiaeth credydwyr o gytundebau blaenorol * delio â thalu dirwyon llys Mae cyngor am Dai yn cynnwys * digartrefedd * rhybudd troi allan * troi allan yn anghyfreithlon neu feddiannu * rhybudd meddiant * ôl-ddyledion rhent * materion UKBA Mae'r canlynol yn cael eu cynnwys ym 'materion eraill yn ymwneud â thai' * bygwth colli cartref neu landlordiaid yn aflonyddu * adfeiliad/ tai mewn cyflwr gwael * ASBO/ASBI Delir â chleientiaid mewn llety dros dro o fewn y cwmpas tai

source: A client's home is defined as the house, caravan, houseboat or other vehicle or structure that is their only or main residence. The references to caravan, houseboat or other vehicle include the land on which it is located or to which it is moored. Operators should interpret the definition as a client would only be in scope if they lived in the home in question. If someone lives or owns another property and the matter relates to a different proeperty to the one they live in then this would be out of scope. If the client is a co-owner of the property and they live in it as their only or main residence (as per the definition of 'home') then this would be in scope. Search guidance for 'timeline' to see the home repossession timeline. *FYI: Debt matters need to arise from an issue where the client owns their own home. Problems relating to homes that are rented or leased from another person fall within Housing.*
cy: Diffinnir cartref y cleient fel tŷ, carafan, cwch preswyl neu gerbyd neu strwythur arall os mai hwn yw ei unig neu ei brif fan preswylio. Pan gyfeirir at garafan, cwch preswyl neu gerbyd arall, mae'r tir lle mae wedi'i leoli neu ei glymu yn cael ei gynnwys hefyd. Dylai gweithredwyr ddehongli'r diffiniad y byddai cleient ond yn y cwmpas os ydynt yn byw yn y cartref dan sylw. Os yw rhywun yn byw neu'n berchen ar eiddo arall a bod y mater yn berthnasol i eiddo sy'n wahanol i'r un y maent yn byw ynddo, yna byddai hyn allan o'r cwmpas. Os yw'r cleient yn gyd-berchennog o'r eiddo ac yn byw ynddo fel ei unig neu ei brif fan preswyl (dan y diffiniad o 'cartref') yna byddai hyn yn y cwmpas. Chwiliwch am ganllaw 'llinell amser' i weld llinell amser ailfeddiannu cartref. *Er gwybodaeth: Mae problemau dyled angen codi o faterion lle mae'r cleient yn berchen ar ei gartref ei hun. Mae problemau yn berthnasol i gartrefi sy'n cael eu rhentu neu ar brydles gan unigolyn arall yn dod o dan 'Tai'.*

source: The mortgage lender is seeking or has sought a court order to recover the property (due to mortgage arrears)
cy: Mae'r benthyciwr morgais yn ceisio neu wedi ceisio am orchymyn llys i adfer yr eiddo (oherwydd ôl-ddyledion morgais)
